import React, { useEffect, useState } from 'react';
import { Outlet } from 'react-router-dom';
import { getAllPosts } from '../../services/postsService';
import Loader from '../common/Loader';

// const postsInit = [
//   {
//     _id: '61819b850644c1e88439681d1',
//     title: 'איפור',
//     category: 'קטגוריה',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d2',
//     title: 'כותרת',
//     category: 'recommendedProduct',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d4',
//     title: 'כותרת',
//     category: 'recommendedProduct',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d5',
//     title: 'כותרת',
//     category: 'recommendedProduct',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d6',
//     title: 'כותרת',
//     category: 'recommendedProduct',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d7',
//     title: 'כותרת',
//     category: 'makeup',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d8',
//     title: 'כותרת',
//     category: 'makeup',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
//   {
//     _id: '61819b850644c1e88439681d9',
//     title: 'כותרת',
//     category: 'makeup',
//     img: 'https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-decorative-cosmetics-makeup-brushes-set-and-royalty-free-image-930934354-1565213062.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=980:*',
//     content:
//       'תוכן מקדים לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך.',
//     contentsInPost: [
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//       'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דולצה. לפמעט מוסן מנת. ליבם .',
//     ],
//     imagesInPost: [
//       'http://picsum.photos/500/100',
//       'http://picsum.photos/500/100',
//     ],
//   },
// ];
const ContainerBlog = () => {
  const [postsInit, setpostsInit] = useState([]);
  useEffect(() => {
    getAllPosts()
      .then((res) => {
        console.log(res.data);
        setpostsInit(res.data);
      })
      .catch((err) => {
        console.log(err);
      });
  }, []);
  if (!postsInit.length > 0) return <Loader />;
  return <Outlet context={postsInit} />;
};

export default ContainerBlog;
